const list = {
  "0592": "厦门",
  "0791": "南昌",
  "0571": "杭州",
  "0351": "太原",
  "0591": "福州",
  "0371": "郑州",
  "02501": "悦享读",
  "010": "北京",
  "0760": "中山",
  "0769": "东莞",
  "020": "广州",
  "021": "上海",
  "022": "天津",
  "0512": "苏州",
  "0535": "烟台",
  "0755": "深圳",
  "023": "重庆",
  "0513": "南通",
  "0931": "兰州",
  "024": "沈阳",
  "0532": "青岛",
  "0752": "惠州",
  "0851": "贵阳",
  "0510": "无锡",
  "0411": "大连",
  "0731": "长沙",
  "0379": "洛阳",
  "0533": "淄博",
  "0577": "温州",
  "025": "南京",
  "0511": "镇江",
  "0431": "长春",
  "0574": "宁波",
  "0311": "石家庄",
  "027": "武汉",
  "0575": "绍兴",
  "0531": "济南",
  "028": "成都",
  "029": "西安",
  "0551": "合肥",
  "0519": "常州",
  "0516": "徐州",
  "0514": "扬州",
  "0757": "佛山",
  "0101": "全国"
}
let _cityArray = []
for(let item in list){
  _cityArray.push({id:item,name:list[item]})
}

function sortByID(a,b){
  return a.id-b.id;
};

export default _cityArray.sort(sortByID)
